GdsQueueEnter/request.xml

<!--Release 34-->
<!--Version Dated as of 17/Oct/2015 14:37:33-->
<!--GDS Queue Enter For Galileo(1G) Request-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <gds:GdsEnterQueueReq
            xmlns:com="http://www.travelport.com/schema/common_v34_0"
            xmlns:gds="http://www.travelport.com/schema/gdsQueue_v34_0"
            AuthorizedBy="user" ProviderCode="1G" ProviderLocatorCode="BQ3MTG"
            PseudoCityCode="PCC" TargetBranch="TRGT_BRCH">
            <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
            <com:QueueSelector Queue="20"/>
        </gds:GdsEnterQueueReq>
    </soapenv:Body>
</soapenv:Envelope>
